fixture/vcr_cassettes/refund/all_refunds_with_opts.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "User-Agent": "Razorpay-Elixir/0.1.0"
      },
      "method": "get",
      "options": {
        "basic_auth": [
          "key_id",
          "key_secret"
        ]
      },
      "request_body": "",
      "url": "https://api.razorpay.com/v1/refunds?count=1"
    },
    "response": {
      "body": "{\"entity\":\"collection\",\"count\":1,\"items\":[{\"id\":\"rfnd_6A2OoiNiprrdHv\",\"entity\":\"refund\",\"amount\":2000,\"currency\":\"INR\",\"payment_id\":\"pay_6A0eCkctN4CdCM\",\"notes\":[],\"created_at\":1471948773}]}",
      "headers": {
        "Cache-Control": "max-age=0, must-revalidate, no-store, nocache, private",
        "Content-Type": "application/json",
        "Date": "Tue, 23 Aug 2016 11:05:59 GMT",
        "Expires": "Fri, 01 Jan 1990 00:00:00 GMT",
        "Pragma": "no-cache",
        "Server": "Apache",
        "Strict-Transport-Security": "max-age=63072000; includeSubDomains",
        "X-Frame-Options": "SAMEORIGIN",
        "Content-Length": "190",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]